posts/how-to-solve/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>How To Solve | Emacsome</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://blank-manash.github.io/blog/posts/how-to-solve/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Manash Baul">
<link rel="prev" href="../rate-limiter/" title="Rate Limiter" type="text/html">
<meta property="og:site_name" content="Emacsome">
<meta property="og:title" content="How To Solve">
<meta property="og:url" content="https://blank-manash.github.io/blog/posts/how-to-solve/">
<meta property="og:description" content="Introduction


This is a slight overview on how you should approach a problem based on my experience. And what are the things you should be ready be with if you are unable to solve it.



Some of Them">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2023-07-06T19:48:23+05:30">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">Emacsome</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">How To Solve</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Manash Baul
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2023-07-06T19:48:23+05:30" itemprop="datePublished" title="2023-07-06 19:48">2023-07-06 19:48</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orge01ffb2" class="outline-2">
<h2 id="orge01ffb2">Introduction</h2>
<div class="outline-text-2" id="text-orge01ffb2">
<p>
This is a slight overview on how you should approach a problem based on my experience. And what are the things you should be ready be with if you are unable to solve it.
</p>

<p>
Some of Them are from the based on the book and additionally added by me.
</p>
</div>
</div>

<div id="outline-container-org3b9742e" class="outline-2">
<h2 id="org3b9742e">Orientation</h2>
<div class="outline-text-2" id="text-org3b9742e">
<p>
Reading the problem statement correctly is very important. It’s very easy to miss a few lines or misinterpret and completely miss the solution.
</p>

<p>
Here are some points to get started.
</p>
</div>

<div id="outline-container-orgb9f16b5" class="outline-3">
<h3 id="orgb9f16b5">Restate and Rephrase</h3>
<div class="outline-text-3" id="text-orgb9f16b5">
<p>
<b>Different Mathematical Models can lead you to different solutions.</b>
</p>

<p>
This is fairly efficient in finding new approaches to
a given problem. Trying to model on what is required, or simply <i>rewriting</i> it in different mathematical notations or even form can reveal different strategies.
</p>
</div>
</div>
<div id="outline-container-org702d9f0" class="outline-3">
<h3 id="org702d9f0">Fantasize an Answer</h3>
<div class="outline-text-3" id="text-org702d9f0">
<p>
Given an answer,
</p>
<ul class="org-ul">
<li>How does it comply with the constraints given?</li>
<li>How does it fails?</li>
<li>What new constraints (which also even can be rewritten or rephrased.) can be concluded?</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2c0615" class="outline-3">
<h3 id="orgb2c0615">Keep Coming Back</h3>
<div class="outline-text-3" id="text-orgb2c0615">
<p>
In case of a hard problem, it can be the case you have missed a word or two because of which the problem seems impossible. Is the given graph just a tree with an extra edge? Keep coming back and read it again. It pays off.
</p>
</div>
</div>
</div>

<div id="outline-container-org31aa81a" class="outline-2">
<h2 id="org31aa81a">Problem Solving</h2>
<div class="outline-text-2" id="text-org31aa81a">
<p>
This overall starts with defining the problem Structure of the given problem.This includes all the observable axioms and overall how the problem moves through different states. You have to observe the movement by getting your hands dirty and propose conjectures based on them. They need not be true or false but they must be proved.
</p>

<p>
Make claims, prove them, Or disprove them.
</p>
</div>
</div>

<div id="outline-container-orga1b0fa5" class="outline-2">
<h2 id="orga1b0fa5">Wishful Thinking And Make it Easier</h2>
<div class="outline-text-2" id="text-orga1b0fa5">
<p>
<i>“If You can’t a solve a problem, there exists an easier version of it which you can, find it!” - Polya.</i>
</p>

<p>
Concentrate on the key difficulty of the problem. What makes it so tough? And what if I remove it. Then if you have a solution, can we extend it. What are the most obvious used ideas? A few strategies may include
</p>

<p>
• Make all the elements same.
• Lower the Constraints
• Making things monotonic.
• Solving with The Extreme Principle.
• Making Things symmetrical.
• Increasing or Decreasing the number of invariant.
• And the all powerful, Simplify.
</p>
</div>
</div>

<div id="outline-container-orgb90099f" class="outline-2">
<h2 id="orgb90099f">Invariants and Monotonicity</h2>
<div class="outline-text-2" id="text-orgb90099f">
<p>
After the restate and rephrase part, try to notice what are the factors that do not change with time. Looking at the final result can also be very helpful for find invariants and mono-variants.
</p>
</div>
</div>

<div id="outline-container-orgcaa190a" class="outline-2">
<h2 id="orgcaa190a">Using Past Experiences, Reductions and Asking Questions</h2>
<div class="outline-text-2" id="text-orgcaa190a">
<p>
Reduction is the method to convert a problem statement into a reduced problem statement. In easy problems, you'd find problems being reduced to very standards problems we know of.
</p>

<p>
Asking relevant questions lead us to observations, these observations are then used tranpose the problem statement into something we already know and can work upon.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../rate-limiter/" rel="prev" title="Rate Limiter">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2023         <a href="mailto:mximpaid@gmail.com">Manash Baul</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
